[CI link](https://github.com/takapg/terraform-cicd-test/actions/runs/7363230205)


### Diff results

<table>
  
  <tr>
    <th>directory</th>
    <th>plan detail</th>
  </tr>

  
  <tr>
    <td>accounts/development/envs/development/env_unique/load_balancer</td>
    <td>




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * null_resource.a
  * null_resource.b


<details><summary>Change Result (Click me)</summary>

```hcl

  # null_resource.a will be created
  + resource "null_resource" "a" {
      + id = (known after apply)
    }

  # null_resource.b will be created
  + resource "null_resource" "b" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details></td>
  </tr>
  
  <tr>
    <td>accounts/development/envs/development/env_unique/network</td>
    <td>




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * null_resource.a


<details><summary>Change Result (Click me)</summary>

```hcl

  # null_resource.a will be created
  + resource "null_resource" "a" {
      + id = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details></td>
  </tr>
  
  <tr>
    <td>accounts/development/envs/development/env_unique/storage</td>
    <td>




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.foo
  * null_resource.a


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "foo!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.bar"
      + id                   = (known after apply)
    }

  # null_resource.a will be created
  + resource "null_resource" "a" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details></td>
  </tr>
  
</table>

---

### No diff results

<details><summary>(Click me)</summary>
  <table>
    
  <tr>
    <th>directory</th>
    <th>plan detail</th>
  </tr>

    
  </table>
</details>


<!-- github-comment: {"JobName":"plan","SHA1":"f736c82f421037182fb0843d010e756fb3d032ef","TemplateKey":"default","Vars":{},"WorkflowName":"Terraform PR check"} -->